<template>
  <div class="privacy-policy">
    <navBartop :title="$route.meta.title" @clickBack="back" class="navtop" v-if="showNavBar"></navBartop>
    <div :class="['privacy-policy-info']">
      <div class="header-centent">
        <p style="text-indent: 0">协议更新时间：2023年 7 月20 日</p>
        <p style="margin-bottom: 0.5em; text-indent: 0">协议生效时间：2023年 7 月20 日</p>
        <p class="f14 text-indent text-underline">
          “万顺福”APP（由武汉万顺福智慧生活服务有限公司运营，以下或简称“我们”或“平台”、“万顺福”）非常重视对您的个人隐私保护，我们将按照本隐私协议（以下称“本协议”）收集、使用、共享和保护您的个人信息。
        </p>
        <p class="f14 text-indent text-underline">
          在您使用“万顺福”APP的产品及服务前，请您仔细阅读并全面了解本协议。您同意隐私协议仅代表您已了解应用提供的功能，以及功能运行所需的必要个人信息，并不代表您已同意我们可以收集非必要个人信息，非必要个人信息会根据您使用过程中的授权情况单独征求您的同意。
        </p>
        <p class="f14 text-indent text-underline">
          相应设备权限并不会默认开启，当涉及重要或敏感的设备权限时，我们会在您使用到相应业务功能时，另行弹窗再次征得您的同意后开启；权限开启后，您还可以随时通过设备设置关闭权限；您不同意开启权限，将不会影响其他非相关业务功能的正常使用。针对个人敏感信息，我们会单独征得您的同意后进行处理。
        </p>
        <p class="f14 text-indent text-underline">
          如您拒绝本《隐私协议》，您仍然能够在无注册/登录状态下使用浏览、查看设置基本功能。您也可以在后续使用服务过程中单独进行授权。
        </p>
        <p class="f14 text-indent">
          我们收集、使用、共享和保护您的个人信息，是在遵守国家法律法规规定的前提下，出于向您提供我们平台中的产品及服务并不断提升产品及服务质量的目的，包括但不限于支持我们开展平台中产品及服务相关的市场活动、完善现有产品及服务功能、开发新产品或新服务。
        </p>
        <p class="understand f14">
          <span><strong>本隐私政策将帮助您了解以下内容：</strong></span>
          <span>1. 信息的收集对象与适用范围</span>
          <span>2. 信息的收集范围</span>
          <span>3. 信息的收集方法</span>
          <span>4. 信息的保存</span>
          <span>5. 信息的用途</span>
          <span>6. 信息的共享</span>
          <span>7. 用户权利</span>
          <span>8. 变更与通知</span>
          <span>9. 未成年人保护</span>
          <span>10. 协议依据与联系反馈</span>
          <span>11. 附录：第三方sdk情况说明</span>
        </p>
      </div>
      <div class="centent">
        <div class="centent-item f14">
          <p class="centent-title"><strong>1. 信息收集的对象与适用范围</strong></p>
          <p class="centent-info">
            1.1本协议收集个人信息的对象主要为使用“万顺福”APP、微信小程序、万顺福商城网站的注册用户。根据《常见类型移动互联网应用程序必要个人信息范围规定》，本APP属于“网上购物类”类型，主要功能为“购买商品”等服务，必须要个人信息为:“1.注册用户移动电话号码；2.收货人姓名（名称）、地址、联系电话；3.支付时间、支付金额、支付渠道等支付信息。”
          </p>
          <p class="centent-info">
            1.2信息收集涉及的范围包括但不限于相关平台的注册、登录、下单、支付、客服沟通、售后功能。
          </p>
        </div>

        <div class="centent-item f14">
          <p class="centent-title"><strong>2. 信息的收集范围</strong></p>
          <p>
            您授权我们收集您的以下个人信息：
          </p>
          <p class="text-indent font-700">
            （一）您须授权我们收集和使用您个人信息的情形
          </p>
          <p class="centent-info">
            我们的产品与/或服务包括一些核心功能，这些功能包含了实现网上购物所必须的功能及保障交易安全所必须的功能。我们可能会收集、保存和使用下列与您有关的信息才能实现上述这些功能。如果您不提供相关信息，您将无法享受我们提供的产品与/或服务。这些功能包括：
          </p>
          <p class="text-indent font-700">
            1、实现网上购物所必须的功能
          </p>
          <p class="text-indent font-700">
            （1）用户注册
          </p>
          <p class="centent-info">
            您首先需要注册一个万顺福商城账户成为万顺福用户。
            <span class="font-700">
              当您注册时，您需要至少向我们提供您准备使用的手机号码，我们将通过发送短信验证码的方式来验证您的身份是否有效。
            </span>
          </p>

          <p class="text-indent font-700">（2）商品信息展示和搜索</p>
          <p class="centent-info">
            为了让您快速地找到您所需要的商品，我们可能会收集您使用我们的产品与/或服务的设备信息（包括设备名称、设备型号、设备识别码、操作系统和应用程序版本、语言设置、分辨率、服务提供商网络ID（PLMN））、浏览器类型来为您提供商品信息展示的最优方式。我们也会为了不断改进和优化上述的功能来使用您的上述个人信息。
          </p>
          <p class="centent-info">
            您也可以通过搜索来精准地找到您所需要的商品或服务。我们会保留您的搜索内容以方便您重复输入或为您展示与您搜索内容相关联的商品。
            <span class="text-underline font-700">
              请您注意，您的搜索关键词信息无法单独识别您的身份，不属于您的个人信息，我们有权以任何的目的对其进行使用；只有当您的搜索关键词信息与您的其他信息相互结合使用并可以识别您的身份时，则在结合使用期间，我们会将您的搜索关键词信息作为您的个人信息，与您的搜索历史记录一同按照本隐私政策对其进行处理与保护。
            </span>
          </p>
          <p class="font-700">
            （3）下单
          </p>
          <p class="centent-info">
            当您准备对您购物车内的商品进行结算时，万顺福商城系统会生成您购买该商品的订单。
            <span class="text-underline font-700">
              您需要在订单中至少填写您的收货人姓名、收货地址以及手机号码，同时该订单中会载明订单号、您所购买的商品或服务信息、您应支付的货款金额及支付方式；您可以另外填写收货人的固定电话、邮箱地址信息以增加更多的联系方式确保商品可以准确送达，但不填写这些信息不影响您订单的生成。
            </span>
          </p>
          <p class="text-indent">
            上述信息构成您的“订单信息”，我们将使用您的订单信息来进行您的身份核验、确定交易、支付结算、完成配送、为您查询订单以及提供客服咨询与售后服务；我们还会使用您的订单信息来判断您的交易是否存在异常以保护您的交易安全。
          </p>

          <p class="text-indent font-700">
            （4）支付功能
          </p>
          <p class="text-indent">
            在您下单后，您可以选择万顺福商城合作的第三方支付机构（包括微信及支付宝等支付通道，以下称“支付机构”）所提供的支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的万顺福订单号与交易金额信息与这些支付机构共享以实现其确认您的支付指令并完成支付。“关联方”指一方现在或将来控制、受控制或与其处于共同控制下的任何公司、机构以及上述公司或机构的法定代表人。“控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、合同或其他被人民法院认定的方式。
          </p>
          <p class="font-700">（5）交付产品与/或服务功能</p>
          <p class="text-indent">
            为保证您购买的产品及/或服务能够顺利、安全、准确送达，我们会向为万顺福商城平台提供物流信息系统和技术服务的相关供应链管理公司披露订单相关配送信息，并由其根据产品/或服务提供主题的指定向相应的物流配送主体同步相关配送信息。您知晓并同意相应物流配送主体不可避免地获知及使用您的配送信息，用于完成支付目的。
            为使我们及时获悉并确认交付进度及状态，向您提供售后与争议解决服务，您同意我们可自物流相关服务主体处收集及交付进度相关信息。
          </p>
          <p class="font-700">
            （6）客服与售后功能
          </p>
          <p class="text-indent">
            我们的电话客服和售后功能会使用您的账号信息和订单信息。
          </p>
          <p class="text-indent">
            1、为保证您的账号安全，我们的呼叫中心客服和在线客服会使用您的账号信息与您核验您的身份。当您需要我们提供与您订单信息相关的客服与售后服务时，我们将会查询您的订单信息。您有可能会在与我们的客服人员沟通时，提供给出上述信息外的其他信息，如当您要求我们变更配送地址、联系人或联系电话。
          </p>
          <p class="text-indent">
            2、保障交易安全所必须的功能
          </p>
          <p class="text-indent">
            为提高您使用我们的产品与/或服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护账户安全，我们可能会通过了解您的浏览信息、订单信息、您常用的软件信息、设备信息等手段来判断您的账号风险，并可能会记录一些我们认为有风险的链接（“URL”）；我们也会收集您的设备信息对于万顺福商城系统问题进行分析、统计流量并排查可能存在的风险、在您选择向我们发送异常信息时予以排查。
          </p>
          <p class="font-700">
            （七）服务位置
          </p>
          <p class="text-indent">
              1、个人信息使用范围：
          </p>
          <p class="text-indent">
            A.您所处的地理位置及目的地信息，以便您不需要手动输入地理坐标即可获得相关的服务，在您使用平台的过程中，您可以随时通过您的设备设置功能，选择是否允许平台获取以及何种情况下可以获取您的位置信息。如果您拒绝平台获取位置信息，您将需要手动定位您的信息。当查找电柜或门店进行换电、买车和租赁时。地图sdk在后台运行的时候，应用在后台激活状态会收集定位信息和mac地址，帮助用户进行里程的准确计算。在订单进行的每一个状态过程中，平台需要以一定频率获取用户的定位位置，以帮助平台更好的给用户提供服务，以及进行相关的安全风险的防控。
          </p>
          <p class="text-indent">
            B.调用的敏感权限：
          </p>
          <p class="text-indent">
            当您使用换电、租赁的基本服务或平台的活动展示内容时，需要调用您设备的位置权限，若您拒绝相关系统权限，您将无法正常使用换电、租赁和获取活动广告位展示内容。
          </p>
          <p class="text-indent">
            C.使用第三方SDK：
          </p>
          <p class="text-indent">
            高德开放平台出行sdk（高德地图sdk），用于实现定位、地图展示、路径规划与导航，第三方会直接收集位置信息、设备信息（包括IMEI、IDFA、AndroidID、MEID、MAC地址、OAID、IMSI、硬件序列号）。此类信息属于实现该SDK功能必需的信息。
          </p>
          <p class="text-indent">
            腾讯位置服务sdk（腾讯地图sdk），用于实现定位、地图展示、路径规划与导航，第三方会直接收集唯一设备标识（UUID、IDFV）、网络类型、手机屏幕密度/尺寸/设备型号/系统版本设备信息。此类信息属于实现该SDK功能必需的信息。
          </p>
          <p class="text-indent">
            腾讯地图相关SDK因业务需要以6次/分钟频率多次获取用户传感器（加速度传感器、陀螺仪传感器）信息，以帮助用户更好定位电柜门店的位置和提供安全监测的服务。
          </p>
          <p class="text-indent font-700">
            （二）您可自主选择提供的个人信息的情形
          </p>
          <p class="text-indent">
            1、为使您购物更便捷或更有乐趣，从而提升您在万顺福的网上购物体验，我们的以下扩展功能中可能会收集和使用您的个人信息。
            <span class="font-700">
              如果您不提供这些个人信息，您依然可以进行网上购物，但您可能无法使用这些可以为您所带来购物乐趣的扩展功能或在购买某些商品时需要重复填写一些信息。这些扩展功能包括：
            </span>
          </p>
          <p class="text-indent font-700">
            （1）基于位置信息的功能：当您通过授权开启移动设备定位功能时并使用基于位置提供的服务时,我们会收集您的位置信息（我们仅收集您当时所处的地理位置，但不会将您各时段的位置信息进行结合以判断您的行踪轨迹）来判断您所处的地点，自动为您推荐您所在区域可以购买的商品或服务您可以在一定设备的系统中关闭定位服务停止我们对您所在位置的收集，但可能因此无法使用我们基于地理位置为您提供的服务，或者无法达到相关服务的预期效果。
          </p>
          <p class="text-indent">
            <span class="font-700">
              （2）基于摄像头（相机）的扩展功能：
            </span>
            您可以使用这个扩展功能完成视频拍摄、拍照、扫码以及人脸识别登录的功能。当您使用人脸识别登录时我们会收集您的面部信息。未来我们可能会将人脸识别技术应用于更多场景，但那时我们会再次与您确认您是否愿意我们使用您的面部信息来实现这些扩展功能。
          </p>
          <p class="text-indent">
            <span class="font-700">
              （3）基于图片上传的扩展功能：
            </span>
            您可以在万顺福商城上传您的照片来实现拍照购物功能和晒单、评价及问答功能，我们会使用您所上传的图片或视频来识别您需要购买的商品或使用包含您所上传图片或视频的晒单、评价及问答内容。
          </p>
          <p class="text-indent">
            <span class="font-700">
              （4）基于语音技术的扩展功能：
            </span>
            您可以直接使用麦克风来进行语音购物或与我们的客服机器人进行咨询和互动。

            <span class="text-underline font-700">
              在这些功能中我们会收集您的录音内容以识别您购物需求和客服与售后需求。
            </span>
          </p>
          <p class="text-indent">
            <span class="font-700">
              （5）基于通讯录信息的扩展功能：
            </span>
            我们将收集您的通讯录信息以方便您在购物时不再手动输入您通讯录中联系人的信息（比如您可以直接为通讯录中的电话号码充值）；为了增加您购物时的社交乐趣，在获得您的同意下我们也可以判断您的好友是否也同为万顺福商城用户，并在万顺福商城为你们的交流建立联系。
          </p>
          <p class="text-indent">
            2、上述扩展功能可能需要您在您的设备中向我们开启您的地理位置（位置信息）、相机（摄像头）、相册（图片库）、麦克风以及通讯录的访问权限，以实现这些功能所涉及的信息的收集和使用。
          </p>
          <p class="text-indent">
            在某些特定业务场景下，为提升更佳的产品或服务体验和业务处理能力，我们会接入由第三方提供的软件开发包（SDK）来为您提供服务。我们接入的部分第三方SDK会收集使用您的个人信息，我们会在您授权同意后获取。如您不同意授权将无法使用该功能服务。如果您希望进一步了解所接入的第三方SDK情况，请您点击本链接阅读第三方SDK情况说明。
          </p>
        </div>

        <!-- 第三条 -->
        <div class="centent-item f14">
          <p class="centent-title">
            3.信息的收集方法
          </p>
          <p class="centent-info">
            您授权我们通过以下方法收集您的个人信息：
          </p>
          <p class="text-indent">
            3.1
            我们将收集和储存在您浏览、访问平台及/或使用平台的产品或服务时主动向我们提供的信息，在具体应用场景需要调用您对应的必要设备权限，并在调用前向您弹窗询问。相关的权限授权授权之后可以在您的个人设备权限设置中进行管理；您可以在设备的设置中选择关闭部分或者全部权限，这将会导致对应的业务功能无法实现或者无法达成预期目的。
            <span class="link-text" @click="toFeatureList">平台功能和服务涉及的相关权限调用，您可以点击当前超链接查看。</span>
          </p>
          <p class="text-indent">
            3.2 我们将收集和储存我们在向您提供产品或服务的过程中记录的与您有关的信息；
          </p>
          <p class="text-indent">
            3.3 我们将收集和储存您通过我们的客服人员及/或其他渠道主动提交或反馈的信息；
          </p>
          <p class="text-indent">
            3.4 我们将向关联公司、商业合作伙伴及第三方独立资料来源，收集和储存其合法获得的与您有关的授权信息；
          </p>
          <p class="text-indent">
            3.5
            为了提供地图导航和其他需要使用位置信息的服务，我们的产品会嵌入合作方的SDK或其他类似的应用程序，第三方合作伙伴获取的相关个人信息的类型、目的、方式、范围详见本协议“6.信息的共享”。
          </p>
          <p class="text-indent">
            3.6 我们将向依法设立的征信机构查询您的相关信用信息，包括但不限于任何信用分、信用报告。
          </p>
        </div>
        <!-- 第三条 end -->

        <!-- 第4条 -->
        <div class="centent-item f14">
          <p class="font-700">
            4.信息的保存
          </p>

          <p class="text-indent">
            4.1 信息保存
          </p>
          <p class="text-indent">4.1.1 在用户使用平台服务期间，我们会持续保存用户的个人信息。</p>
          <p class="text-indent">
            4.1.2
            当您自主删除个人信息或注销账户，我们将按照法律、法规规定的的最短期限保留您的现有个人信息，在法律法规要求的最短保存期限内，我们将不再对您的个人信息进行商业化使用。当您的个人信息超出上述保存期限，我们将会对其进行匿名化处理。
          </p>
          <p class="text-indent">
            a.
            为配合人民法院、人民检察院、公安机关、国家安全机关侦查用户使用平台服务过程中产生的犯罪行为、更好保护其他用户生命财产安全，当用户自主删除个人信息或注销账户，平台将在刑法规定的犯罪追诉时效期间内，加密隔离存档用户个人信息。
          </p>
          <p class="text-indent">
            b. 如您使用平台服务的过程中，存在严重违反法律法规、平台协议、平台规则情形，您的违法、违约记录及相应的平台信用记录，将被永久保存。
          </p>
          <p class="text-indent">
            4.2 信息存放地域
          </p>
          <p class="text-indent font-700">
            我们收集的您的个人信息，将在中国内地存储和使用。
          </p>
          <p class="text-indent">
            4.3 信息跨境提供的严格限制
          </p>
          <p class="text-indent">
            4.3.1
            <span class="font-700">
              目前我们不存在向境外提供个人信息的场景。
            </span>
          </p>
          <p class="text-indent">
            4.3.2 如将来涉及向境外传输个人信息，我们将事先明确向您告知个人信息出境的目的、接收方、安全保障措施情况，另行征得您的同意。
          </p>
          <p class="text-indent">
            4.3.3
            <span class="font-700">
              非经法定程序及获得您个人的单独同意，“万顺福”不会将您的个人信息提供给境外任何第三方机构或个人。
            </span>
          </p>
          <p class="text-indent">
            4.4 安全保护措施
          </p>
          <p class="text-indent">
            4.4.1 我们将采用严格的安全制度以及行业通行的安全技术和程序来确保您的个人信息不丢失、泄露、毁损或被未经授权的访问、使用。
          </p>
          <p class="text-indent">
            4.4.2 我们采取以下安全技术措施保护您的个人信息。
          </p>
          <p class="text-indent">
            a. 用户个人信息被加密储存在服务器中，并通过数据隔离技术进行存储。
          </p>
          <p class="text-indent">
            b. 数据传输过程中使用加密传输协议
          </p>
          <p class="text-indent">
            c. 严格控制数据访问权限，设立完善的敏感数据访问权限申请、审批制度。
          </p>
          <p class="text-indent">d. 建立数据安全监控和审计制度，进行全面数据安全控制。</p>
          <p class="text-indent">4.4.3 我们同时采取其他安全措施保护您的个人信息</p>
          <p class="text-indent">a. 公司统一协调管理数据安全工作，并设数据安全小组、推动各项数据安全活动。</p>
          <p class="text-indent">b. 新项目、新系統上线前对数据安全(包括用户个人信息数据)进行项目风险评估。</p>
          <p class="text-indent">c. 与全体员工及服务外包人员签暑保密协议，并严格按照工作职责分配数据访问权限。</p>
          <p class="text-indent">d. 定期开展面向公司全体员工及外包服务人员的信息安全教育及培训。</p>
          <p class="text-indent">4.5 安全事件处置</p>
          <p class="text-indent">
            4.5.1 为应对个人信息泄露、毁损、丢失出现的安全风险，公司明确了上述安全事故和漏洞，内部处理流程（包括应急响应流程）和补救措施。
          </p>
          <p class="text-indent">4.5.2 一旦发生安全事件，我们将及时向您告知事件基本情况和风险、我们已经采取或将要采取的措施、您如何自行降低风险的建议。</p>
          <p class="text-indent">
            4.5.3 我们将及时以推送通知、信函或电话方式将安全事件情况通知受影响的用户。当难以逐一告知用户时，我们将通过发布平台公告的方式发布警示信息。
          </p>
          <p class="text-indent font-700">
            4.5.4 个人信息安全投诉和举报电话：4006424888
            ，收到投诉、举报后，我们将会及时受理并在15个工作日内做出处理，一经发现涉及用户个人信息的违规行为，我们将予以严肃处理；涉嫌违法犯罪的，依法移送司法行政机关处理。
          </p>
          <p class="text-indent">4.6 停止运营</p>
          <p class="text-indent">4.6.1 如平台停止运营，我们将至少提前30日在平台发布公告，并及时停止收集个人信息。</p>
          <p class="text-indent">4.6.2 停止运营后，我们将停止对个人信息的商业化使用，并在满足法律法规规定的最短保存期后，对收集的个人信息进行匿名化处理。</p>
          <p class="text-indent">4.7免责条款</p>
          <p class="text-indent">
            4.7.1在使用“万顺福”进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息、联络方式或者联系地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供，否则对因此而造成的您的个人信息的泄露和损失，“万顺福”不承担任何责任。如您发现自己的个人信息泄密，尤其是账户及或其密码发生泄露，请您立即联络“万顺福”客服，以便我们能够及时采取相应措施。
          </p>
          <p class="text-indent">4.7.2我们将根据法律法规规定及本协议约定对您的个人信息予以保密，但下列情形除外：</p>
          <p class="text-indent">（1）法律、法规、规章及其他规范性文件另有规定；</p>
          <p class="text-indent">（2）政府机关、司法机关及监管部门提出要求；</p>
          <p class="text-indent">（3）相关信息已成为公开信息；</p>
          <p class="text-indent">（4）您同意无须再严格保密；</p>
          <p class="text-indent">（5）本协议另有约定；</p>
          <p class="text-indent">（6）其他合法情形。</p>
        </div>
        <!-- 第4条 end -->

        <!-- 第5条 -->

        <div class="centent-item f14">
          <p class="font-700">
            5. 信息的用途
          </p>

          <p class="text-indent">您授权我们出于以下用途使用您的个人信息：</p>
          <p class="text-indent">5.1 向您提供我们的产品及服务，并进行平台相关网站及APP的管理和优化；</p>
          <p class="text-indent">
            5.2 提升和改善平台现有产品及服务的功能和质量，包括但不限于产品及服务内容的定制及更新，会用于活动信息和优惠信息的展示和更新。；
          </p>
          <p class="text-indent">5.3 开展平台产品及服务相关的市场活动，向您推送最新的市场活动信息及优惠方案；</p>
          <p class="text-indent">5.4 提高产品及服务安全性，包括但不限于身份验证、客户服务、安全防范、诈骗监测、存档和备份；</p>
          <p class="text-indent">
            5.5
            协助行政机关、司法机构有权机关开展调查，并遵守适用法律法规及其他向有权机关承诺之义务；在收集信息之时所通知您的用途以及与上述任何用途有关的其他用途；
          </p>
          <p class="text-indent">
            5.6
            此外，我们向您发送与上述用途有关的信息和通知，包括但不限于为保证服务完成所必须的验证码、使用产品或服务时所必要的推送通知、关于我们产品或服务的新闻以及市场活动及优惠促销信息。
          </p>
        </div>
        <!-- 第5条 end -->

        <!-- 第6条 -->
        <div class="centent-item f14">
          <p class="font-700">6.信息的共享</p>

          <p class="text-indent">我们对您的个人信息承担保密义务，但您授权我们在下列情况下将您的信息与第三方共享：</p>
          <p class="text-indent">
            6.1
            如果您通过我们平台使用的某些产品及服务是由我们的合作伙伴提供的，或是由我们与合作伙伴或供应商共同提供的，我们将与其共享向您提供相应产品及服务所必需的信息；我们会通过应用程序接口（API）、软件工具开发包（SDK）与第三方进行必要的数据共享，不同版本的第三方SDK会有所不同，我们会尽到审慎义务，努力保障数据安全。
          </p>
          <p class="text-indent">
            6.1.1如果您希望进一步了解所接入的第三方SDK情况，
            <span class="link-text" @click="toShareInfoList">请您点击本链接阅读第三方SDK情况说明。</span>
          </p>
          <p class="text-indent">
            6.1.2 如果您希望进一步了解我们所接入的第三方服务平台情况情况，
            <span class="link-text" @click='toShareInfoList'>请您点击本链接阅读第三方服务平台情况说明。</span>
          </p>
          <p class="text-indent">6.2 为了与第三方开展联合推广活动，我们与其共享开展活动所必需的以及在活动过程中产生的相关信息；</p>
          <p class="text-indent">
            6.3 为了维护您的合法权益，在协助处理与您有关的交易纠纷或争议时，我们会向您的交易相对方或存在利害关系的第三方提供解决交易纠纷或争议所必需的信息；
          </p>
          <p class="text-indent">6.4 根据法律法规的规定或行政机关、司法机构有权机关要求，我们会向其提供您的相关信息；</p>
          <p class="text-indent">
            6.5
            其他经您同意或授权可以向第三方提供您的个人信息的情况。您通过“万顺福”跳转功能访问第三方网站经营者、通过“万顺福”接入第三方服务，以上第三方有自己的隐私权保护规则。当您查看第三方创建的网页或使用第三方开发的应用程序时，这些第三方会获取、使用您的个人信息，该获取、使用不受“万顺福”的控制及本协议的约束。“万顺福”会尽商业上的合理努力去要求这些第三方对您的个人信息采取保护措施，但“万顺福”无法保证这些第三方一定会按照“万顺福”的要求采取保护措施，请您与这些第三方直接联系以获得关于他们的隐私权规则的详细情况。如您发现这些第三方创建的网页或第三方开发的应用程序存在风险时，建议您终止相关操作以保护您的合法权益。
          </p>
          <p class="text-indent">
            6.6
            当您在我们平台公开共享任何信息时，任何人都可能在使用平台时查看或访问这些信息。如您在平台上传的照片、评价信息。您在使用平台服务时自愿共享的信息，会涉及您或他人的个人信息，请您谨慎选择并自行承担责任。
          </p>
        </div>
        <!-- 第6条 end -->

        <!-- 第7条 -->
        <div class="centent-item f14">
          <p class="font-700">7.用户权利</p>
          <p class="text-indent">7.1访问和更正个人信息。</p>
          <p class="text-indent">您可以通过以下方式在“万顺福”平台访问和更正个人信息∶</p>
          <p class="text-indent">
            （1）您的账户信息：PC端您可以在“用户中心”页面的“个人信息”菜单中查阅您提交给万顺福商城的所有个人信息，你也可通过上述途径更新除或修改信息，移动端具体路径为：账户名称、个人资料信息：首页--“我的”进入我的万顺福商城--右上角“账户”或点击头像进入账号设置--个人信息；账户密码、电话号码、安全信息：首页--“我的”进入我的万顺福商城--右上角“账户”或点击头像进入账号设置--账户安全；兴趣爱好：首页--“我的”进入我的万顺福商城--收藏的商品，浏览记录。
          </p>

          <p class="text-indent">
            （2）您的收货信息：PC端您可以通过访问“用户中心”页面的“收货地址”菜单中随时添加、更改、删除您的收货地址信息（包括收货人姓名、收货地址、收货人的电话号码），移动端具体路径为：首页--“我的”进入我的万顺福商城--右上角“账户”或点击头像进入账号设置--地址管理。您也可以将最常用的收货地址设置为默认地址，如此您下次购买商品时在您未更改收货地址时，您的商品会配送到您默认地址。
          </p>
          <p class="text-indent">
            （3）您的订单信息：PC端您可以通过访问“我的订单”页面查看您的所有已经完成、待付款或待售后的订单。移动端具体路径为：移动端首页--“我的”进入我的万顺福商城--商城订单/门店订单--待收款/待收货/退换售后。
            <span class="font-700">
              您可以选择删除已经完成和已取消的订单来删除您的订单信息，但这样可能导致我们无法准确判断您的购买信息而难以提供相应的售后服务，您也无法对删除的订单使用我们的晒单和评价功能。
            </span>
          </p>
          <p class="text-indent">
            （4）您的浏览信息：您可以访问或清除您的搜索历史记录、查看、修改和删除兴趣以及管理其他数据。移动端路径为：搜索历史记录：首页--“我的”进入我的万顺福商城--浏览记录；兴趣及其他数据：首页--“我的”进入我的万顺福商城--收藏的商品。
          </p>
          <p class="text-indent">
            （5）您的评论信息：PC端您可以访问您的个人评论，或对商品进行追评。移动端路径为：首页--“我的”进入我的万顺福商城--待评价--评价中心。
          </p>
          <p class="text-indent">
            （6）对于您在使用我们的产品与/或服务过程中产生的其他个人信息需要访问或更正，请随时联系我们。我们会根据本隐私政策所列明的方式和期限响应您的请求。
          </p>
          <p class="text-indent">
            （7）您无法访问和更正的个人信息：除上述列明的信息外，您的部分个人信息我们还无法为您提供访问和更正的服务，这些信息主要是为了提升您的用户体验和保证交易安全所收集的您的设备信息、您使用扩展功能时产生的个人信息。
            上述信息我们会在您的授权范围内进行使用，您无法访问和更正，但您可联系我们进行删除或做匿名化处理。
          </p>
          <p class="text-indent">7.2 撤回同意。“万顺福”将通过以下方式保障用户撤回同意的权利∶</p>
          <p>a.您可以通过设备的设置功能，关闭相应设备权限（包括位置、通讯录、照片、麦克风、相机、通知），撤回对“万顺福”获取您个人信息的授权。</p>
          <p class="text-indent">
            b.您还可以通过删除信息撤回部分授权。当您撤回同意或授权后，导致“万顺福”无法为您提供撤回授权部分对应的服务。但您撤回同意或授权，不影响撤回前基于您的同意开展的个人信息处理。
          </p>
          <p class="text-indent">7.3 个人信息可携带权的保护。</p>
          <p class="text-indent">您有权获得已向我方提供的个人数据信息，有权申请对您合法存储在我方的个人信息予以迁移，我方将依照法定程序予以配合。</p>
          <p class="text-indent">7.4 删除信息</p>
          <p class="text-indent">您在我们的产品与/或服务页面中可以直接清除或删除的信息，包括订单信息、浏览信息、收货地址信息；</p>
          <p class="font-700">在以下情形中，您可以向我们提出删除个人信息的请求：</p>
          <p class="text-indent">（1）如果我们处理个人信息的行为违反法律法规；</p>
          <p class="text-indent">（2）如果我们收集、使用您的个人信息，却未征得您的同意；</p>
          <p class="text-indent">（3）如果我们处理个人信息的行为违反了与您的约定；</p>
          <p class="text-indent">
            （4）如果我们终止服务及运营。若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。若我们响应您的删除请求，我们不能保证立即从备份系统中删除相应的信息，但会在备份系统更新时删除这些信息。
          </p>
          <p class="text-indent">7.5 账号注销说明</p>
          <p class="text-indent">
            您可以在个人中心→设置→账号安全下选择注销账号，若您的万顺叫车账号
            <span class="font-700">无未完成的订单</span>
            ，即可注销账号，您的账号注销之后，平台将会加密隔离您的个人信息。如果注销过程中遇到任何问题可联系客服处理。
          </p>
          <p class="text-indent">7.6 个人信息主体获取个人信息副本</p>
          <p class="text-indent">您有权获取您的个人信息副本，您可以随时与我们联系，我们将在15个工作日内回复您的请求。</p>
        </div>
        <!-- 第7条 end -->

        <!-- 第8条 -->
        <div class="centent-item f14">
          <p class="font-700">8.变更与通知</p>
          <p class="text-indent">
            我们的个人信息保护规则可能变更。未经您明确同意，我们不会削减您按照本个人信息保护规则所应享有的权利。我们会在本页面上发布对本协议所做的任何变更并通过APP内消息通知送达，请您及时查阅。
          </p>
          <p class="text-indent">如平台发生以下变化，我们将及时对本隐私协议进行相应的修订：</p>
          <p class="text-indent">8.1 平台业务功能发生变更。</p>
          <p class="text-indent">8.2 用户个人信息保存地域发生变更。</p>
          <p class="text-indent">8.3 用户个人信息使用规则发生变更。</p>
          <p class="text-indent">8.4 平台的联系方式及投诉渠道发生变更。</p>
          <p class="text-indent">8.5 发生其他可能影响用户个人信息安全或影响用户隐私权利的变更。</p>
          <p class="text-indent">
            请您注意，任何安全系统都存在未知的风险。随着网络平台信息服务的进一步提升，隐私协议的内容会随时更新。更新后的隐私协议我们将以弹出的形式提醒您查看，以了解我们对于隐私保护的最新措施。
          </p>
        </div>
        <!-- 第8条 end -->

        <div class="centent-item f14">
          <p class="font-700">9、未成年人保护</p>
          <p class="text-indent">
            1、万顺福商城非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用我们的产品与/或服务前，应事先取得您监护人的同意。万顺福商城根据国家相关法律法规的规定保护未成年人的个人信息。
          </p>
          <p>
            2、我们不会主动直接向未成年人收集其个人信息。对于经监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许、监护人同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。
          </p>
          <p class="text-indent">
            3、如果有事实证明未成年人并未取得监护人同意的情况下注册使用了我们的产品与/或服务，我们会与相关监护人协商，并设法尽快删除相关个人信息。
          </p>
          <p class="text-indent">4、对于可能涉及的不满14周岁的儿童个人信息，我们进一步采取以下措施予以保障：</p>
          <p class="text-indent">
            （1）对于收集到的儿童个人信息，我们除遵守本隐私政策关于用户个人信息的约定外，还会秉持正当必要、知情同意、目的明确、安全保障、依法利用的原则，严格遵循《儿童个人信息网络保护规定》等法律法规的要求进行存储、使用、披露，且不会超过实现收集、使用目的所必须的期限，到期后我们会对儿童个人信息进行删除或匿名化处理。我们会指定专人负责儿童个人信息保护事宜，并设立了儿童个人信息保护的邮箱
            <span class="font-700">【wsestore@wsecar.com】</span>
            。我们还会制定儿童个人信息保护的内部专门制度。
          </p>
          <p class="text-indent">
            （2）当您作为监护人为被监护的儿童选择使用万顺福商城相关服务时，我们可能需要向您收集被监护的儿童个人信息，用于向您履行相关服务之必要。在具体服务中需要向您收集儿童个人信息的，我们会事先取得您的授权同意，并告知您收集的目的和用途。如果您不提供前述信息，您将无法享受我们提供的相关服务。此外，您在使用晒单、评价及问答功能分享商品相关信息时可能会主动向我们提供儿童个人信息，请您明确知悉并谨慎选择。您作为监护人应当正确履行监护职责，保护儿童个人信息安全。若儿童本人需要注册或使用我们的产品与/或服务，您应正确引导并予以监护。
          </p>

          <p class="text-indent">
            （3）儿童或其监护人有权随时访问和更正儿童个人信息，还可以向我们提出更正和删除的请求。如您对儿童个人信息相关事宜有任何意见、建议或投诉、举报，请联系我们。我们会随时为您提供帮助。
          </p>
        </div>

        <div class="centent-item f14 content-10">
          <p class="font-700">10.协议依据与反馈</p>
          <p>
            本隐私协议依据和参考《国家安全法》、《网络安全法》、《数据安全法》、《个人信息保护法》、《电信和互联网用户个人信息保护规定》、《App违法违规收集使用个人信息行为认定方法》、《网络安全实践指南—移动互联网应用基本业务功能必要信息规范》以及其他相关法规和国家标准、行业标准制定和编撰。
            如果您对本个人信息保护规则有任何疑问、意见或建议，请通过APP客户服务端口或邮件wsecar@wsecar.com与我们联系。
          </p>

          <div style="text-align:right; margin-top: 2em">
            <p>
              运营方：武汉万顺福智慧生活服务有限公司
            </p>
            <p>
              地址：湖北省武汉市东西湖区径河街道五环路以东、黄狮海以南五环时尚广场(超平地块)4、5栋5号楼单元22层06号
            </p>
            <p>信息保护负责人：王健</p>
            <p>联系电话：15549407554</p>
            <p>万顺福商城</p>
          </div>
        </div>

        <div class="centent-item f14 content-11">
          <p class="centent-title" style="font-size: 14px">11.附录：第三方sdk情况说明</p>
          <p>
            为保障万顺福app的稳定运行和实现相关业务功能，我们会接入由第三方提供的软件开发包（sdk）实现上述目标。我们会尽到审慎业务，对合作方获取信息的软件工具开发包（sdk）进行严格的安全监测，以保护数据安全。
          </p>
          <p>
            我们接入的第三方sdk主要服务于用户的需求，因此在满足新的服务需求及业务功能变更时，我们可能会调整我们接入的第三方sdk。我们会及时在本说明中向您公开说明接入第三方sdk的最新情况。请注意，第三方sdk可能因为其版本升级、策略调整原因导致数据处理类型存在一定变化，请以其公示的官方说明为准。
          </p>
          <p>目前万顺福接入的第三方SDK列明如下：</p>
          <p>1、SDK名称：高德开放平台出行sdk</p>
          <p>厂家：高德软件有限公司</p>
          <p>
            收集信息类型：位置信息（经纬度、精确位置、粗略位置）；设备信息【IP 地址、GNSS信息、WiFi状态、WiFi参数、WiFi列表、SSID、BSSID、基站信息、信号强度的信息、蓝牙信息、传感器信息（矢量、加速度、压力、方向、地磁、陀螺、温度、光敏、nema信号）、设备信号强度信息、外部存储目录】；设备标识信息（IMEI、IDFA、IDFV、Android ID、MEID、MAC地址、OAID、IMSI、ICCID、硬件序列号）、当前应用信息（应用名、应用版本号）、设备参数及系统信息（系统属性、设备型号、操作系统、运营商信息）、SIM卡状态、传感器列表，使用的敏感权限：存储；
          </p>
          <p>使用目的：实现定位、地图展示、路径规划与导航</p>
          <p>使用的敏感系统权限：位置权限</p>
          <p>具体使用场景：自动定位到用户坐标大头针、叫车起终点路线、展示司机乘客位置、营销活动展示</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接：
            <a href="https://lbs.amap.com/pages/privacy/">https://lbs.amap.com/pages/privacy/</a>
          </p>
          <p></p>
          <p>2、SDK名称：支付宝支付</p>
          <p>厂家：支付宝（中国）网络技术有限公司</p>
          <p>
            收集信息类型：设备信息（Androidid/厂商/机型/系统版本/时间/IMEI/IMSI、SIM卡序列号/MAC地址/物理位置/网络信息/Ssid/bssid）/订单号/订单金额/软件运行列表/ip地址
          </p>
          <p>使用目的：实现使用支付宝付款</p>
          <p>使用的敏感系统权限：无</p>
          <p>具体使用场景：支付：收银台支付</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接：
            https://render.alipay.com/p/c/k2cx0tg8
          </p>
          <p></p>
          <p>3、SDK名称：腾讯buglysdk（集成腾讯tinkersdk）</p>
          <p>厂家：腾讯科技（深圳）有限公司</p>
          <p>
            收集信息类型：安卓系统（手机型号、手机品牌、安卓系统版本、安卓系统api等级、厂商系统版本、cpu架构类型、设备是否root、磁盘空间占用大小、sdcard空间占用大小、内存空间占用大小、网络类型、软件运行列表和PID）；IOS版本（设备型号、操作系统版本、操作系统内部版本号、wifi状态、cpu属性、内存剩余空间、磁盘空间/磁盘剩余空间、运行时手机状态（进程所占内存、虚拟内存）、IDFV、是否越狱、地区编码、软件运行列表和PID）、存储
          </p>
          <p>使用目的：排查崩溃问题，帮助app提升稳定性</p>
          <p>使用的敏感系统权限：无</p>
          <p>具体使用场景：监测app的异常</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接：
              https://privacy.qq.com/document/preview/fc748b3d96224fdb825ea79e132c1a56
          </p>
          <p></p>
          <p>4、SDK名称：闪验sdk</p>
          <p>厂家：上海创蓝文化传播有限公司</p>
          <p>
            收集信息类型：IOS【设备名称、机器型号、系统版本、ip、网络制式、当前时间戳、idfv、屏幕宽高、网络类型、运营商类型、bundleId、mac地址、IMEI、ICCID、IMSI、OAID、设备型号厂商】；安卓【设备系统版本、运营商类型、subID、私网IP、应用包名、应用包签名、网络连接状态】；运营商信息、已安装应用包名、WiFi状态。
          </p>
          <p>使用目的：识别用户手机号码快速登录</p>
          <p>使用的敏感系统权限：存储</p>
          <p>具体使用场景：一键登录、获取手机号</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接:
              https://shanyan.253.com/document/details?lid=639&cid=91&pc=28&pn=%25E9%2597%25AA%25E9%25AA%258CSDK
          </p>
          <p></p>
          <p>5、SDK名称：微信支付sdk</p>
          <p>厂家：深圳市腾讯计算机系统有限公司</p>
          <p>收集信息类型：设备信息（厂商/机型/系统版本/时间/IMEI/IMSI、SIM卡序列号/MAC地址/物理位置/网络信息）/订单号/订单金额/应用列表</p>
          <p>使用目的：实现用户使用微信支付和分享</p>
          <p>使用的敏感系统权限：无</p>
          <p>具体使用场景：支付：收银台支付</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            微信支付隐私政策链接：
           https://www.tenpay.com/v3/helpcenter/low/privacy.shtml
          </p>
          <p>
            微信隐私权政策链接：
              https://www.wechat.com/tpl/oversea/new/page/privacy_policy/index?cc=&v=&scene=&needopenplatform=&lang=zh_cn
          </p>
          <p></p>
          <p>6、SDK名称：北京奇虎360加固SDK</p>
          <p>厂家：北京鸿享技术服务有限公司</p>
          <p>
            收集信息类型：加固包信息（应用或SDK的包名、版本、签名文件的MD5；用于基础加固服务，以及盗版监测、运营数据分析、崩溃日志分析、终端环境检测、病毒木马检测服务。）；设备基础信息（网络类型、系统运行语言环境、操作系统版本名称、操作系统版本、机型、系统版本、厂商、终端主板名称、品牌、设备内存大小、手机屏幕分辨率、运行环境；用于基础加固服务，以及盗版监测、运营数据分析、崩溃日志分析、终端环境检测服务。）；网络信息（DNS
            服务器IP、是否开启VPN；用于基础加固服务，以及终端环境检测服务）；安全信息（安全补丁程序级别；用于基础加固服务，以及崩溃日志分析、终端环境检测服务。）；终端环境信息（Android
            ID、OAID，root、xposed、双开、frida、模拟器环境；用于基础加固服务，以及终端环境检测、风险设备识别、加固程序脱壳对抗检测。）；游戏专用旋转矢量传感器、加速度传感器、手机类型、已安装应用包名信息
          </p>
          <p>使用目的：用于检测App故障和诊断,App安全加固保护,盗版检测服务,威胁环境检测服务,以便帮助用户快速解决异常情况</p>
          <p>使用的敏感系统权限：无</p>
          <p>具体使用场景：基础加固服务；盗版监测服务；数据分析服务；终端威胁检测服务；崩溃日志分析服务</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接：
            https://jiagu.360.cn/#/global/help/322
          </p>
          <p></p>
          <p>7、SDK名称：联通登录sdk</p>
          <p>厂家：上海创蓝文化传播有限公司</p>
          <p>
            收集信息类型：设备名称、机器型号、系统版本、IP地址、网络制式、当前时间戳、IDFV、屏幕宽高、网络类型、运营商类型、bundleID、MAC地址、IMEI、ICCID、IMSI、OAID、设备型号、厂商、subID、私网IP、应用包名、应用包签名、网络连接状态
          </p>
          <p>使用目的：识别用户手机号码快速登录</p>
          <p>使用的敏感系统权限：无</p>
          <p>具体使用场景：一键登录、获取手机号</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接：
              https://shanyan.253.com/document/details?lid=639&cid=91&pc=28&pn=%25E9%2597%25AA%25E9%25AA%258CSDK
          </p>
          <p></p>
          <p>8、SDK名称：移动登录sdk</p>
          <p>厂家：上海创蓝文化传播有限公司</p>
          <p>
            收集信息类型：设备名称、机器型号、系统版本、IP地址、网络制式、当前时间戳、IDFV、屏幕宽高、网络类型、运营商类型、bundleID、MAC地址、IMEI、ICCID、IMSI、OAID、设备型号、厂商、subID、私网IP、应用包名、应用包签名、网络连接状态、SIM卡状态
          </p>
          <p>使用目的：识别用户手机号码快速登录</p>
          <p>使用的敏感系统权限：无</p>
          <p>具体使用场景：一键登录、获取手机号</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接：https://shanyan.253.com/document/details?lid=639&cid=91&pc=28&pn=%25E9%2597%25AA%25E9%25AA%258CSDK
          </p>
          <p></p>
          <p>9、SDK名称：电信登录sdk</p>
          <p>厂家：上海创蓝文化传播有限公司</p>
          <p>
            收集信息类型：设备名称、机器型号、系统版本、IP地址、网络制式、当前时间戳、IDFV、屏幕宽高、网络类型、运营商类型、bundleID、MAC地址、IMEI、ICCID、IMSI、OAID、设备型号、厂商、subID、私网IP、应用包名、应用包签名、网络连接状态
          </p>
          <p>使用目的：识别用户手机号码快速登录</p>
          <p>使用的敏感系统权限：无</p>
          <p>具体使用场景：一键登录、获取手机号</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接：
              https://shanyan.253.com/document/details?lid=639&cid=91&pc=28&pn=%25E9%2597%25AA%25E9%25AA%258CSDK
          </p>
          <p></p>
          <p>10、SDK名称：Glide（仅Android使用）</p>
          <p>厂家：个人开发者</p>
          <p>收集信息类型：无</p>
          <p>使用目的：图片加载库</p>
          <p>使用的敏感系统权限：存储</p>
          <p>
            隐私政策链接：
           https://github.com/bumptech/glide
          </p>
          <p>11、SDK名称：腾讯位置服务sdk</p>
          <p>厂家：腾讯科技（深圳）有限公司</p>
          <p>收集信息类型：安卓版本【OAID、系统属性、操作系统及版本、系统设置、设备型号、运营商基站信息（Cellid）、WIFI信息（WiFi状态、WIFI参数、附近的WIFI列表、连接的WIFI）、传感器信息（重力传感器、线性加速度传感器、陀螺仪传感器、加速度传感器、磁场传感器、光线传感器、旋转矢量传感器、压力传感器、方向传感器、线性加速度传感器）、蓝牙信息、精确位置信息（GPS信息）、网络类型、手机屏幕密度、尺寸、IP地址】；IOS版本【IDFV、操作系统及版本、设备型号、WIFI信息（WiFi状态、WIFI参数、连接的WIFI）、传感器信息（重力传感器、线性加速度传感器、陀螺仪传感器、加速度传感器、磁场传感器、光线传感器、旋转矢量传感器、压力传感器、方向传感器、线性加速度传感器）、蓝牙信息、精确位置信息（GPS信息）、网络类型、手机屏幕密度、尺寸、IP地址、设备运动数据】、AAID、运行中进程信息、传感器列表、WiFi参数（ssid、bssid）、SIM卡状态、已安装应用包名，使用的敏感权限：存储；</p>
          <p>使用目的：实现定位、地图展示、路径规划与导航</p>
          <p>使用的敏感系统权限：位置权限</p>
          <p>具体使用场景：自动定位到用户坐标大头针、换电电柜和用户起终点位置、租车网点和用户起终点位置</p>
          <p>共享方式：SDK本地采集</p>
          <p>
            隐私政策链接：https://lbs.qq.com/userAgreements/agreements/privacy
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  import { Cell, CellGroup } from 'vant'
  import navBartop from '@/components/commons/navBartop'

  export default {
    components: {
      [CellGroup.name]: CellGroup,
      [Cell.name]: Cell,
      navBartop
    },
    data(){
      return{
        showNavBar: !!this.$route.query.jumpFrom,
      }
    },
    created() {
      document.body.removeAttribute('class', 'gray-bg')
    },
    methods: {
      back() {
        this.$router.back()
      },
      // 信息收集清单
      toFeatureList() {
        this.$router.push({
          path: '/app/smartlife/personalInformationList'
        })
      },
       // 第三方共享清单
      toShareInfoList() {
        this.$router.push({
          path: '/app/smartlife/listOfThirdPartyInformationSharing'
        })
      }
    },
  }
</script>
<style lang="less" scoped>
@import "./base.less";

  .privacy-policy {
    height: 100%;
    padding-top: 20px;
    .f14 {
      font-size: 0.56rem;
    }
    .van-nav-bar__left .van-icon {
      color: #6d6d6d;
    }
    .privacy-policy-info {
      padding: 0 0.72rem;
      .header-centent {
        .header-title {
          font-size: 0.72rem;
          text-align: center;
          margin: 1.2rem 0 0.8rem 0;
        }
        .effective-date {
          text-align: center;
          margin-bottom: 0.96rem;
        }
        .introduction {
          text-align: center;
          margin-bottom: 0.44rem;
        }
        .understand {
          margin: 0.48rem 0 0.88rem 0;
          line-height: 0.96rem;
          span {
            display: block;
          }
        }
      }
      .centent {
        .centent-item {
          margin-bottom: 0.8rem;
          .centent-title {
            margin-bottom: 0.48rem;
          }
          .centent-info {
            line-height: 0.96rem;
            word-break: break-all;
            text-indent: 2em;
            margin-bottom: 0.32rem;
          }
        }
      }
    }
  }

  p {
    text-indent: 2em;
    word-break: break-all;
  }

  .content-11 {
    padding-bottom: 50px;
    p {
      font-size: 12px;
    }
  }
  /deep/ .van-nav-bar__left{
    padding-left: 10px !important;
  }
  /deep/ .van-icon-arrow-left:before{
    font-size: 18px !important;
    font-weight: 600;
    color: #111111;
  }
</style>
