<template>
  <div class="page-container">
    <div class="card-panel">
      <p>
        “万顺福”APP（由武汉万顺福智慧生活服务有限公司运营，以下或简称“我们”或“平台”、“万顺福”）非常重视对您的个人隐私保护，并希望通过本概要向您简洁介绍我们如何收集、使用和保护您的个人信息。本概要为《万顺福APP隐私政策》附件，如您希望了解我们详细的隐私政策，请查阅概要后的隐私政策正文。
      </p>
    </div>

    <div class="card-panel">
      <div class="card-title font-600">一、我们如何收集和使用您的个人信息</div>
      <p>
        我们将收集和储存在您浏览、访问平台及/或使用平台的产品或服务时主动向我们提供的信息，在具体应用场景需要调用您对应的必要设备权限，并在调用前向您弹窗询问。相关的权限授权授权之后可以在您的个人设备权限设置中进行管理；您可以在设备的设置中选择关闭部分或者全部权限，这可能导致对于的业务功能无法实现或者无法达成预期目的。
        <span class="link-text" @click="toFeatureList">
          平台功能和服务涉及的相关权限调用，您可以点击当前超链接查看。
        </span>
      </p>
      <p>1.1 手机号码，当您注册时，您需要至少向我们提供您准备使用的手机号码，我们将通过发送短信验证码的方式来验证您的身份是否有效。</p>
      <p>
        1.2设备信息，为了让您快速地找到您所需要的商品，我们可能会收集您使用我们的产品与/或服务的设备信息（包括设备名称、设备型号、设备识别码、操作系统和应用程序版本、语言设置、分辨率、服务提供商网络ID（PLMN））、浏览器类型来为您提供商品信息展示的最优方式。我们也会为了不断改进和优化上述的功能来使用您的上述个人信息。
      </p>
      <p>
        1.3订单信息，当您准备对您购物车内的商品进行结算时，万顺福商城系统会生成您购买该商品的订单。您需要在订单中至少填写您的收货人姓名、收货地址以及手机号码，同时该订单中会载明订单号、您所购买的商品或服务信息、您应支付的货款金额及支付方式；您可以另外填写收货人的固定电话、邮箱地址信息以增加更多的联系方式确保商品可以准确送达，但不填写这些信息不影响您订单的生成
      </p>
      <p>
        1.4
        交易信息，在您下单后，您可以选择万顺福商城合作的第三方支付机构（包括微信及支付宝等支付通道，以下称“支付机构”）所提供的支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的万顺福订单号与交易金额信息与这些支付机构共享以实现其确认您的支付指令并完成支付。
      </p>
      <p>
        1.5
        物流信息，为保证您购买的产品及/或服务能够顺利、安全、准确送达，我们会向为万顺福商城平台提供物流信息系统和技术服务的相关供应链管理公司披露订单相关配送信息，并由其根据产品/或服务提供主题的指定向相应的物流配送主体同步相关配送信息。您知晓并同意相应物流配送主体不可避免地获知及使用您的配送信息，用于完成支付目的。
        为使我们及时获悉并确认交付进度及状态，向您提供售后与争议解决服务，您同意我们可自物流相关服务主体处收集及交付进度相关信息。
      </p>
      <p>
        1.6
        位置信息，我们会收集您的位置信息（我们仅收集您当时所处的地理位置，但不会将您各时段的位置信息进行结合以判断您的行踪轨迹）来判断您所处的地点，自动为您推荐您所在区域可以购买的商品或服务
      </p>
      <p>
        1.7通讯录，我们将收集您的通讯录信息以方便您在购物时不再手动输入您通讯录中联系人的信息（比如您可以直接为通讯录中的电话号码充值）；为了增加您购物时的社交乐趣，在获得您的同意下我们也可以判断您的好友是否也同为万顺福商城用户，并在万顺福商城为你们的交流建立联系。
      </p>
      <p>
        1.8
        相机，您可以使用这个扩展功能完成视频拍摄、拍照、扫码以及人脸识别登录的功能。当您使用人脸识别登录时我们会收集您的面部信息。未来我们可能会将人脸识别技术应用于更多场景，但那时我们会再次与您确认您是否愿意我们使用您的面部信息来实现这些扩展功能。
      </p>
      <p>
        1.9
        当您与平台客服团队联系时，我们以通话录音及人工录入的方式记录您的通话信息、您提出的意见或者建议、您提供的姓名、联系方式，以便我们处理纠纷、解决问题或向您反馈结果。如果您拒绝我们收集此类信息会导致您无法拨打平台的客服电话或客服团队无法将处理结果反馈到您，但不影响您使用平台核心业务功能。
      </p>
      <p>
        1.10
        其他根据我们具体产品及服务的需要而收集的您的个人信息，包括但不限于您对我们及我们的产品或服务的意见、建议、您曾经使用或经常使用的移动应用软件以及使用场景和使用习惯等信息。
      </p>
    </div>

    <div class="card-panel">
      <div class="card-title font-600">二、我们如何共享您的信息</div>
      <p>我们对您的个人信息承担保密义务，但您授权我们在下列情况下将您的信息与第三方共享：</p>
      <p>为了提升我们的产品及服务质量或向您提供全新的产品及服务，我们会在关联公司内部共享您的相关信息，也可能将我们收集的信息提供给第三方用于分析和统计；</p>
      <p>
        如果您通过我们平台使用的某些产品及服务是由我们的合作伙伴提供的，或是由我们与合作伙伴或供应商共同提供的，我们将与其共享向您提供相应产品及服务所必需的信息；我们可能会通过应用程序接口（API）、软件工具开发包（SDK）与第三方进行必要的数据共享，不同版本的第三方SDK会有所不同，我们会尽到审慎义务，努力保障数据安全。
      </p>
      <p>
        对于我们使用的第三方软件工具开发包（“SDK”），以及与第三方共享的个人信息，您可以点击
        <span class="link-text" @click="toShareInfoList">
          万顺福APP第三方共享信息清单
        </span>
        查阅
      </p>
      <p></p>
    </div>

    <div class="card-panel">
      <div class="card-title font-600">三、您如何管理您的信息</div>
      <p>
        您有权管理您的个人信息，包括查询、更正和删除您的账号信息、搜索记录，改变您授权同意的范围或撤回授权，以及注销您的账号。您可以通过我们的App中提供的功能设置进行上述操作。
      </p>
      <p>如果您无法通过上述方式进行管理，您可以通过我们以下提供的联系方式联系我们，我们将在15天内回复您的要求。</p>
      <p></p>
    </div>
    <div class="card-panel">
      <div class="card-title font-600">四、我们如何做好未成年人保护</div>
      <p>
        我们非常重视未成年人个人信息的保护。由于我们的网站和服务主要面向成人，如您为未成年人的，建议您请您的父母或监护人仔细阅读本隐私权政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。
      </p>
    </div>
    <div class="card-panel">
      <div class="card-title font-600">五、您如何联系我们</div>
      <p>如果您对本个人信息保护政策有任何疑问、意见或建议，请通过APP客户服务端口或邮件wsecar@wsecar.com与我们联系。</p>
    </div>
    <div class="card-panel text-right">
      <p>运营方：武汉万顺福智慧生活服务有限公司</p>

      <p>地址：深圳市宝安区西乡街道龙腾社区共和工业路西发B区旭生研发大厦20层</p>

      <p>信息保护负责人：连享雄</p>
      <p>联系电话：4006424888</p>
      <p>万顺叫车</p>
    </div>
  </div>
</template>

<script>
  export default {
    name: 'privacyPolicySummary',
    data() {
      return {}
    },

    methods: {
      // 信息收集清单
      toFeatureList() {
        this.$router.push({
          path: '/app/smartlife/personalInformationList'
        })
      },
      // 第三方共享清单
      toShareInfoList() {
        this.$router.push({
          path: '/app/smartlife/listOfThirdPartyInformationSharing'
        })
      },
    },
  }
</script>

<style lang="less" scoped>
  @import './base.less';

  .page-container {
    padding: 16px;

    .card-panel {
      margin-bottom: 16px;
      p {
        line-height: 1.85;
        font-family: 'Arial', 'Microsoft YaHei', '黑体', '宋体', sans-serif;
        text-indent: 2em;
      }

      .card-title {
        margin-bottom: 8px;
      }
    }
  }
</style>
