<template>
  <div class="agreement-wrap">
    <div class="agreement">
      <p>在您注销您的万顺福账号之前，请充分阅读、理解并同意下列事项:</p>
      在此善意地提醒您，您注销本万顺福账号的行为，将导致我们终止对您提供本服务。注销成功后，我们将删除您的个人信息，使其保持不可被检索、访问的状态，或对其进行匿名化处理。您知晓并理解，依据相关法律法规规定或双方约定，我们仅会在实现法律规定或双方约定目的必须的最短时间内留存您的相关个人信息。
      <br />
      1、 如果您仍执意注销本万顺福账号，您的万顺福账号需满足以下条件: 账号内无未完成的订单、已提供服务但未支付的订单;
      <br />
      2、在万顺福账号注销期间，如果您的万顺福账号涉及争议纠纷，包括但不限于投诉、举报、诉讼、仲裁、国家有权机关调查等，我们有权自行终止万顺福账号的注销而无需另行得到您的同意。
      <br />
      3、万顺福账号一旦被注销原账号将不可恢复，请您在操作之前自行备份万顺福账号相关的所有信息和数据。注销万顺福账号，您将无法再使用万顺福原账号，也将无法找回您万顺福原账号内所有历史记录信息(即使您使用相同的手机号码再次注册并使用)，包括但不限于:
      <br />
      (1)您将无法登录、使用万顺福账号;
      <br />
      (2)万顺福账号的个人资料和历史信息(包括但不限于用户名、昵称、头像、订单记录等)都将无法找回;
      <br />
      4、注销本万顺福账号并不代表本万顺福账号注销前的账号行为和相关责任得到豁免或减轻。
    </div>
  </div>
</template>

<script></script>

<style lang="less" scoped>
  .agreement {
    margin: 12px 16px;
    font-size: 26rpx;
    font-family: PingFangSC-Regular, PingFang SC;
    font-weight: 400;
    color: #999999;
    line-height: 40rpx;
  }
</style>
